1.Create a Pandas Series from the list [10, 20, 30, 40, 50]. Print the Series, its index, and data type.
Then create a DataFrame with columns "Name", "Age", and "City" containing at least 4 rows of data

In [6]:
import pandas as pd
my_list=[10, 20, 30, 40, 50]
df=pd.Series(my_list)
#df
# df.index
# df
# print(type(df))

my_data={'Name':['Anon','Niaj','Naruto','Kakashi'],
         'Age':[26,25,17,30],
         'City':['Barisal','Barishal','Leafvillage','LV']}   
create=pd.DataFrame(my_data)
create

      Name  Age         City
0     Anon   26      Barisal
1     Niaj   25     Barishal
2   Naruto   17  Leafvillage
3  Kakashi   30           LV

2.Using any DataFrame, write code to print the number of rows and columns,
column data types (.dtypes), and summary statistics (.describe()).

In [11]:
data = {
    'Name': ['Niaj', 'Sara', 'John', 'Lina'],
    'Age': [20, 21, 19, 22],
    'Marks': [85.5, 90.0, 78.5, 88.0],
    'Passed': [True, True, False, True]}
dff=pd.DataFrame(data)
dff.shape
dff.dtypes
dff.describe()

             Age      Marks
count   4.000000   4.000000
mean   20.500000  85.500000
std     1.290994   5.016639
min    19.000000  78.500000
25%    19.750000  83.750000
50%    20.500000  86.750000
75%    21.250000  88.500000
max    22.000000  90.000000

3. Create a DataFrame using the dictionary below:


data = {
    'Product': ['Pen', 'Book', 'Eraser', 'Pencil'],
    'Price': [10, 50, 5, 7],
    'Quantity': [100, 60, 200, 150]
}

Print .columns, .index. Access a single column and one full row.

In [22]:
data = { 'Product': ['Pen', 'Book', 'Eraser', 'Pencil'],
         'Price': [10, 50, 5, 7], 
         'Quantity': [100, 60, 200, 150] }
df=pd.DataFrame(data)
df.columns.tolist()
df.index
single_col=df['Product']
single_col

['Product', 'Price', 'Quantity']

4. Using .loc[] and .iloc[], show the first row, the second column, and a 2×2 block    from the middle of your DataFrame.

In [38]:
data = { 'Product': ['Pen', 'Book', 'Eraser', 'Pencil'],
         'Price': [10, 50, 5, 7], 
         'Quantity': [100, 60, 200, 150] }
df=pd.DataFrame(data)
# df.loc[0]
# df.loc[:,'Price']
# df.loc[1:2,['Price','Quantity']]
df.iloc[0]
df.iloc[:,1:2]
df.iloc[1:3,1:3]

   Price  Quantity
1     50        60
2      5       200

5. Create a 4×3 DataFrame of student names and marks. Drop one column using .drop(), drop one row by index

In [44]:
data = { 'Students': [1, 2, 3, 4],
         'Names': ['Niaj', 'Anon', 'Niz', 'Naruto'], 
         'Marks': [100, 99, 97, 98]}
df=pd.DataFrame(data)
df.drop('Marks',axis=1)
df.drop(0)

   Students   Names  Marks
1         2    Anon     99
2         3     Niz     97
3         4  Naruto     98

6. Create a DataFrame of employees with columns "Name", "Department", and "Salary".
  Sort it by "Salary" in ascending order and by "Name" in descending order.

In [49]:
data={
    'Name':['Niaj', 'Anon', 'Niz', 'Naruto'], 
    'Department': ['CSE','BBA','CS','SHINOBI'],
    'Salary':[5000,4000,3000,6000]}
df=pd.DataFrame(data)
copy=df.sort_values(['Salary','Name'],ascending=[1,0])
copy

     Name Department  Salary
2     Niz         CS    3000
1    Anon        BBA    4000
0    Niaj        CSE    5000
3  Naruto    SHINOBI    6000

7. Create a DataFrame of 8 students with columns "Name" and "Score". Filter and print students with Score > 60 and those with Score < 40

In [58]:
data={
    'Name':['Niaj', 'Anon', 'Niz', 'Naruto','kakashi','Hinata','Shikamaru','Sakura'],
    'Score':[80,50,70,55,79,38,58,98]}
df=pd.DataFrame(data)
score_greater_than_60=df.loc[(df['Score']>60)]
score_less_than_40=df.loc[(df['Score']<40)]

score_less_than_40

     Name  Score
5  Hinata     38